[
  {
    "name": "Miso-Butter Roast Chicken With Acorn Squash Panzanella",
    "ingredients": [
      "1 (3½–4-lb.) whole chicken",
      "2¾ tsp. kosher salt",
      "2 acorn squash (3 lb.)",
      "2 tbsp. chopped sage",
      "1 tbsp. chopped rosemary",
      "6 tbsp. unsalted butter",
      "3 tbsp.",
      "¼ tsp. ground allspice",
      "crushed red pepper flakes",
      "freshly ground black pepper",
      "⅓ loaf sturdy white bread",
      "1 (2½ cups)",
      "2 medium apples (gala pink lady 14 oz.) cored",
      "2 tbsp. extra-virgin olive oil",
      "½ red onion sliced",
      "3 tbsp. apple cider vinegar",
      "1 tbsp. white miso",
      "¼ cup all-purpose flour",
      "2 tbsp. unsalted butter",
      "¼ cup dry white wine",
      "2 cups unsalted chicken broth",
      "2 tsp. white miso",
      "kosher salt",
      "freshly ground pepper"
    ],
    "instructions": [
      "Pat chicken dry with paper towels, season all over with 2 tsp. salt, and tie legs together with kitchen twine. Let sit at room temperature 1 hour.",
      "Meanwhile, halve squash and scoop out seeds. Run a vegetable peeler along ridges of squash halves to remove skin. Cut each half into ½-thick wedges arrange on a rimmed baking sheet.",
      "Combine sage, rosemary, and 6 Tbsp. melted butter in a large bowl pour half of mixture over squash on baking sheet. Sprinkle squash with allspice, red pepper flakes, and ½ tsp. salt and season with black pepper toss to coat.",
      "Add bread, apples, oil, and ¼ tsp. salt to remaining herb butter in bowl season with black pepper and toss to combine. Set aside.",
      "Place onion and vinegar in a small bowl season with salt and toss to coat. Let sit, tossing occasionally, until ready to serve.",
      "Place a rack in middle and lower third of oven preheat to 425°F. Mix miso and 3 Tbsp. room-temperature butter in a small bowl until smooth. Pat chicken dry with paper towels, then rub or brush all over with miso butter. Place chicken in a large cast-iron skillet and roast on middle rack until an instant-read thermometer inserted into the thickest part of breast registers 155°F, 50–60 minutes. (Temperature will climb to 165°F while chicken rests.) Let chicken rest in skillet at least 5 minutes, then transfer to a plate reserve skillet.",
      "Meanwhile, roast squash on lower rack until mostly tender, about 25 minutes. Remove from oven and scatter reserved bread mixture over, spreading into as even a layer as you can manage. Return to oven and roast until bread is golden brown and crisp and apples are tender, about 15 minutes. Remove from oven, drain pickled onions, and toss to combine. Transfer to a serving dish.",
      "Using your fingers, mash flour and butter in a small bowl to combine.",
      "Set reserved skillet with chicken drippings over medium heat. You should have about ¼ cup, but a little over or under is all good. (If you have significantly more, drain off and set excess aside.) Add wine and cook, stirring often and scraping up any browned bits with a wooden spoon, until bits are loosened and wine is reduced by about half (you should be able to smell the wine), about 2 minutes. Add butter mixture cook, stirring often, until a smooth paste forms, about 2 minutes. Add broth and any reserved drippings and cook, stirring constantly, until combined and thickened, 6–8 minutes. Remove from heat and stir in miso. Taste and season with salt and black pepper.",
      "Serve chicken with gravy and squash panzanella alongside."
    ],
    "image": "miso-butter-roast-chicken-acorn-squash-panzanella",
    "foodId": "fb89d512ef0443f8a9cfcacc68eca4c8",
    "imageUrl": "https://res.cloudinary.com/dqmwlzgpe/image/upload/v1749474703/ingredify/miso-butter-roast-chicken-acorn-squash-panzanella.jpg"
  },
  {
    "name": "Crispy Salt and Pepper Potatoes",
    "ingredients": [
      "2 egg whites",
      "1 potatoes (1 inch in diameter)",
      "2 kosher salt",
      "¾ ground black pepper",
      "1 chopped rosemary",
      "1 chopped thyme",
      "1 chopped parsley"
    ],
    "instructions": [
      "Preheat oven to 400°F and line a rimmed baking sheet with parchment. In a large bowl, whisk the egg whites until foamy (there shouldn’t be any liquid whites in the bowl). Add the potatoes and toss until they’re well coated with the egg whites, then transfer to a strainer or colander and let the excess whites drain. Season the potatoes with the salt, pepper, and herbs. Scatter the potatoes on the baking sheet (make sure they’re not touching) and roast until the potatoes are very crispy and tender when poked with a knife, 15 to 20 minutes (depending on the size of the potatoes).",
      "Transfer to a bowl and serve."
    ],
    "image": "crispy-salt-and-pepper-potatoes-dan-kluger",
    "foodId": "384bc4810e9941fe819c45633ec0c972",
    "imageUrl": "https://res.cloudinary.com/dqmwlzgpe/image/upload/v1749474704/ingredify/crispy-salt-and-pepper-potatoes-dan-kluger.jpg"
  },
  {
    "name": "Thanksgiving Mac and Cheese",
    "ingredients": [
      "1 cup evaporated milk",
      "1 cup whole milk",
      "1 tsp. garlic powder",
      "1 tsp. onion powder",
      "1 tsp. smoked paprika",
      "½ tsp. freshly ground black pepper",
      "1 tsp. kosher salt",
      "2 lb. extra-sharp cheddar coarsely grated",
      "4 oz. full-fat cream cheese",
      "1 lb. elbow macaroni"
    ],
    "instructions": [
      "Place a rack in middle of oven preheat to 400°. Bring evaporated milk and whole milk to a bare simmer in a large saucepan over medium heat. Whisk in garlic powder, onion powder, paprika, pepper, and 1 tsp. salt. Working in batches, whisk in three fourths of the cheddar, then all of the cream cheese.",
      "Meanwhile, bring a large pot of generously salted water to a boil (it should have a little less salt than seawater). Cook macaroni, stirring occasionally, until very al dente, about 4 minutes. Drain in a colander.",
      "Add macaroni to cheese sauce in pan and mix until well coated. Evenly spread out half of macaroni mixture in a 13x9 baking dish. Sprinkle half of remaining cheddar evenly over. Layer remaining macaroni mixture on top and sprinkle with remaining cheddar. Bake until all of the cheese is melted, about 10 minutes. Let cool slightly before serving."
    ],
    "image": "thanksgiving-mac-and-cheese-erick-williams",
    "foodId": "e1f0f2e6af4d42429b207e3cf83249e8",
    "imageUrl": "https://res.cloudinary.com/dqmwlzgpe/image/upload/v1749474705/ingredify/thanksgiving-mac-and-cheese-erick-williams.jpg"
  },
  {
    "name": "Italian Sausage and Bread Stuffing",
    "ingredients": [
      "1 (¾- 1-) round italian loaf",
      "1-inch cubes (8 cups)",
      "2 olive oil",
      "2 sweet italian sausage casings",
      "1 stick unsalted butter",
      "3 medium onions chopped",
      "4 celery ribs chopped",
      "5 garlic cloves",
      "4 eggs lightly beaten",
      "¾ cup heavy cream",
      "½ cup turkey giblet stock reduced-sodium chicken broth",
      "1 cup grated parmigiano-reggiano (2)",
      "½ cup coarsely chopped flat-leaf parsley",
      "4- shallow ceramic glass baking dish"
    ],
    "instructions": [
      "Preheat oven to 350°F with rack in middle. Generously butter baking dish.",
      "Put bread in 2 shallow baking pans and bake, switching position of pans halfway through baking, until just dried out, about 10 minutes.",
      "Heat 1 tablespoon oil in a 12-inch heavy skillet over medium-high heat until it shimmers, then cook half of sausage, stirring and breaking it into small pieces, until golden brown, about 6 minutes. Transfer with a slotted spoon to a large bowl. Brown remaining sausage in remaining tablespoon oil, transferring to bowl.",
      "Pour off fat from skillet and wipe clean. Heat butter over medium heat until foam subsides, then cook onions, celery, garlic, and ½ teaspoon each of salt and pepper, stirring occasionally, until golden, 12 to 15 minutes. Add vegetables and bread to sausage.",
      "Whisk together eggs, ½ cup cream, turkey stock, cheese, and parsley, then stir into stuffing and cool completely, about 30 minutes. Reserve 5 cups stuffing to stuff turkey and spoon remainder into baking dish, then drizzle with remaining ¼ cup cream. Cover stuffing and chill.",
      "About 1 hour before stuffed turkey is finished roasting, bring dish of stuffing to room temperature. When turkey is done, increase oven temperature to 425°F and bake stuffing, covered tightly with foil, until hot throughout, about 20 minutes. Remove foil and bake until top is golden and crisp, about 15 minutes more.",
      "Cooks Note: Bread can be toasted 3 days ahead and kept (once cool) in a sealed bag at room temperature. Stuffing can be prepared (but not baked) 4 hours before roasting turkey. If baking stuffing at the same time as potatoes, put stuffing in upper third of oven and potatoes in bottom third (allow extra time)."
    ],
    "image": "italian-sausage-and-bread-stuffing-240559",
    "foodId": "31afdefb75a34440b376cea81934c9a8",
    "imageUrl": "https://res.cloudinary.com/dqmwlzgpe/image/upload/v1749474706/ingredify/italian-sausage-and-bread-stuffing-240559.jpg"
  },
  {
    "name": "Newtons Law",
    "ingredients": [
      "1 dark brown sugar",
      "1 hot water",
      "1 ½ oz. bourbon",
      "½ oz. fresh lemon juice",
      "2 apple butter (storebought homemade)",
      "garnish: orange freshly grated ground cinnamon"
    ],
    "instructions": [
      "Stir together brown sugar and hot water in a cocktail shaker to dissolve. Let cool, then add bourbon, lemon juice, and apple butter and fill with ice. Shake until well chilled, about 15 seconds. Strain into an ice-filled rocks glass. Garnish with orange twist and cinnamon."
    ],
    "image": "newtons-law-apple-bourbon-cocktail",
    "foodId": "2abc240176974ca78343853919f8237b",
    "imageUrl": "https://res.cloudinary.com/dqmwlzgpe/image/upload/v1749474707/ingredify/newtons-law-apple-bourbon-cocktail.jpg"
  },
  {
    "name": "Warm Comfort",
    "ingredients": [
      "2 chamomile tea bags",
      "1½ oz. reposado tequila",
      "¾ oz. fresh lemon juice",
      "1 tbsp. agave nectar"
    ],
    "instructions": [
      "Place 2 chamomile tea bags in a heatsafe vessel, such as a large liquid measuring cup. Pour in 1 ½ cups boiling water, and let steep 5 minutes, then remove tea bags.",
      "Add 1 ½ oz. reposado tequila, ¾ oz. fresh lemon juice, and 1 Tbsp. agave nectar and stir until incorporated. Pour into a 16-ounce insulated mug (or two smaller 8-ounce mugs) and drink hot."
    ],
    "image": "warm-comfort-tequila-chamomile-toddy",
    "foodId": "325efa410a2043dfac0be0d1a3530b54",
    "imageUrl": "https://res.cloudinary.com/dqmwlzgpe/image/upload/v1749474708/ingredify/warm-comfort-tequila-chamomile-toddy.jpg"
  },
  {
    "name": "Apples and Oranges",
    "ingredients": [
      "3 oz. grand marnier",
      "1 oz. amaro averna",
      "pat salted butter (½)",
      "1 cup hot apple cider",
      "1½ 3 tsp. fresh lemon juice (taste",
      "depending sweetness your cider)",
      "garnish: freshly ground pink peppercorns",
      "2 lemon wheels"
    ],
    "instructions": [
      "Add 3 oz. Grand Marnier, 1 oz. Amaro Averna, and a small pat of salted butter to a 16-ounce travel mug or large heatproof measuring cup. Add 1 cup hot apple cider and stir until butter melts.",
      "Add 1½ tsp. fresh lemon juice and taste for sweetness, adding additional if needed. If serving in travel mug, garnish with ground pink peppercorns and seal. If serving in mugs, divide drink between two warmed mugs and garnish each with a pink peppercorn-dusted lemon wheel."
    ],
    "image": "apples-and-oranges-spiked-cider",
    "foodId": "47d0e69a46a24ac4b40e8189419ee735",
    "imageUrl": "https://res.cloudinary.com/dqmwlzgpe/image/upload/v1749474709/ingredify/apples-and-oranges-spiked-cider.jpg"
  },
  {
    "name": "Turmeric Hot Toddy",
    "ingredients": [
      "¼ cup granulated sugar",
      "¾ tsp. ground turmeric",
      "1 ½ oz. amontillado sherry",
      "1 oz. bourbon",
      "aged rum",
      "scotch",
      "mezcal",
      "gin",
      "1 oz. turmeric syrup",
      "½ oz. fresh lemon juice",
      "garnish: dehydrated lemon wheel"
    ],
    "instructions": [
      "For the turmeric syrup, combine ½ cup hot water and ¼ cup sugar in a liquid measuring cup or mason jar. Add ¾ tsp. ground turmeric and stir—or seal and shake—until sugar is completely dissolved. (This makes enough syrup for 4 drinks. Syrup can be used immediately or refrigerated, covered, up to 10 days. Shake or stir before using to reincorporate turmeric.)",
      "For the toddy, combine 1 ½ oz. Amontillado sherry, 1 oz. bourbon (or other spirit of choice), 1 oz. Turmeric Syrup, and ½ oz. fresh lemon juice in a sturdy pint glass or 16-ounce thermos. Top with 8 oz. hot water and stir gently. Garnish with dehydrated lemon wheel if desired."
    ],
    "image": "turmeric-hot-toddy-claire-sprouse",
    "foodId": "0ac7d4b04298479e8123d3d38e6cdbf2",
    "imageUrl": "https://res.cloudinary.com/dqmwlzgpe/image/upload/v1749474710/ingredify/turmeric-hot-toddy-claire-sprouse.jpg"
  },
  {
    "name": "Instant Pot Lamb Haleem",
    "ingredients": [
      "¾ cup assorted dals (chana dal",
      "moong dal",
      "masoor dal/urad dal)",
      "¼ cup white jasmine rice long-grain rice",
      "¼ cup pearl barley",
      "1½ lb. bone-in lamb stew meat",
      "3 tsp. kosher salt",
      "1-6 piece fresh ginger",
      "3 medium shallots sliced",
      "⅓ cup ghee vegetable oil",
      "4 garlic cloves grated",
      "2 tbsp. 1½ tsp. garam masala",
      "1 tsp. cayenne pepper",
      "1 tsp. ground turmeric",
      "3 green thai chiles stems",
      "½ cup (lightly packed) chopped cilantro",
      "½ white onion chopped",
      "2 limes",
      "wedges"
    ],
    "instructions": [
      "Combine dals, rice, and barley in a medium bowl. Pour in water to cover and swish dals and grains around with your fingers. Drain and repeat process until water runs clear enough to see your hands through. Pour in water to cover and let dals and grains soak at room temperature at least 2 hours, or cover and chill up to 12 hours.",
      "Place lamb on a plate, pat dry with paper towels, and season all over with 2 tsp. salt set aside. Peel ginger by scraping off skin with a spoon. Finely grate half of ginger set aside. Thinly slice remaining ginger. Stack slices and cut crosswise into matchsticks set aside.",
      "If using an electric pressure cooker, combine shallots and ghee in pot and set to sauté function or high. Cook, stirring often and adjusting heat as needed if your cooker has that option, until shallots are just beginning to brown, about 8 minutes (or about 6 minutes if cooking in oil). Reduce to normal function or medium if possible, or, if your cooker doesn’t have a lower setting, turn off for a minute if mixture is getting too hot. Add reserved ginger matchsticks and cook, stirring often, until shallots are brown and crisp and ginger is frizzled, 4–10 minutes, depending on your cooker. Using a slotted spoon, transfer shallots and ginger to a plate, spreading out into a single layer. Season lightly with salt let cool.",
      "Add garlic, garam masala, cayenne, turmeric, and reserved grated ginger, and cook, stirring constantly, until fragrant, about 30 seconds. Add lamb and stir to coat in spices. Cook, stirring often with a wooden spoon and repeatedly adding splashes of water as spices begin to stick to bottom of pot and scraping up browned bits, until flavors come together, about 15 minutes.(Bhuna, the process of repeated sticking and scraping, is a Southeast Asian cooking technique that brings out the flavor of the spices and ensures they don’t taste raw and grainy.)",
      "Drain dal mixture and add to pot along with 1 tsp. salt and 5 cups water. Secure lid and bring to full pressure according to manufacturer’s directions. Cook 1½ hours. Let sit 20 minutes, then manually release pressure and open up.",
      "Taste haleem and add more salt and cayenne if needed. Add chiles if using. (These are for flavor, not heat feel free to leave them out.) Simmer on normal function or medium, stirring often, 5 minutes. Stir in ½ cup cilantro.",
      "Serve haleem with white onion, lime wedges, reserved crispy shallots and ginger, and more chopped cilantro.",
      "If using a medium Dutch oven or stovetop pressure cooker, cook shallots and ghee over high heat, stirring often, until shallots are just beginning to brown, about 8 minutes (or about 6 minutes if cooking in oil). Add reserved ginger matchsticks and cook, stirring often, until shallots are brown and crisp and ginger is frizzled, 5–8 minutes. Using a slotted spoon, transfer shallots and ginger to a plate, spreading out in a single layer. Season lightly with salt let cool.",
      "Reduce heat to medium, add garlic, garam masala, cayenne, turmeric, and reserved grated ginger, and cook, stirring constantly, until fragrant, about 30 seconds. Add lamb and stir to coat in spices. Cook, stirring often with a wooden spoon and repeatedly adding splashes of water as spices begin to stick to bottom of pot and scraping up browned bits, until flavors come together, about 15 minutes. (Bhuna, the process of repeated sticking and scraping, is a Southeast Asian cooking technique that brings out the flavor of the spices and ensures they don’t taste raw and grainy.)",
      "Drain dal mixture and add to pot along with 1 tsp. salt and 6½ cups water (if using a Dutch oven) or 5 cups water (for pressure cooker). Increase heat to high and bring to a boil, then reduce heat to the low, cover pot, and cook, stirring and scraping bottom of pot every 15–20 minutes, until meat is falling off the bone and dals and grains have nearly melted into the stew, 4½–5 hours. (If using a stovetop cooker, increase heat to high and bring to a boil. Secure lid and bring to full pressure according to manufacturer’s directions. Cook 1½ hours. Let sit 20 minutes, then manually release pressure and open up.)",
      "Taste haleem and add more salt and cayenne if needed. Add chiles if using. (These are for flavor, not heat feel free to leave them out.) Simmer over medium heat, stirring often, 5 minutes. Stir in ½ cup cilantro.",
      "Serve haleem with white onion, lime wedges, reserved crispy shallots and ginger, and more chopped cilantro.",
      "Do ahead: Haleem can be made 1 day ahead. Let cool cover and chill. Reheat over medium until warmed through."
    ],
    "image": "instant-pot-lamb-haleem",
    "foodId": "5f4b8fec47b44f51aae240be67bbb2fd",
    "imageUrl": "https://res.cloudinary.com/dqmwlzgpe/image/upload/v1749474712/ingredify/instant-pot-lamb-haleem.jpg"
  },
  {
    "name": "Spiced Lentil and Caramelized Onion Baked Eggs",
    "ingredients": [
      "1 (14.5-) basic lentil soup",
      "amy’s",
      "1 onion sliced",
      "½ tsp. turmeric",
      "1 tsp. cumin",
      "¼ tsp. aleppo pepper ⅛ tsp. crushed red pepper flakes",
      "2 tbsp. tomato paste",
      "3 eggs",
      "2 tbsp. ghee",
      "unsalted butter",
      "olive oil",
      "½ tsp. whole cumin seeds",
      "olive oil",
      "kosher salt freshly ground black pepper",
      "parsley",
      "finishing"
    ],
    "instructions": [
      "Place an oven rack in the center of the oven, then preheat to 350°F.",
      "In a medium, oven-safe pan, heat 1 Tbsp. olive oil over medium heat. Add 1 large, thinly sliced onion and ½ tsp. Kosher salt. Cook, stirring often, until golden brown, about 25 minutes.",
      "Add ½ tsp. turmeric, 1 tsp. cumin, ¼ tsp. Aleppo pepper (or ⅛ tsp. crushed red pepper flakes), and 2 Tbsp. tomato paste. Cook and stir constantly until the onions are coated and the tomato paste has darkened slightly, about 2 minutes. Add ⅓ cup water stir and scrape up all the browned bits on the bottom of the pan for 1 to 2 minutes, or until the liquid looks thickened and saucy. Add one 14-oz. can of lentil soup cook, stirring to combine, 1 to 2 minutes. Turn off the heat and season with salt, pepper, and more Aleppo pepper or red pepper flakes to taste.",
      "Using a spoon, create 3 wells in the lentil mixture. Carefully crack 1 egg into each well. Transfer the pan to the oven and bake until the whites of the eggs are just set, 11 to 13 minutes.",
      "While the eggs bake, in a small pot or butter warmer, heat 2 Tbsp. unsalted butter, ghee, or olive oil over medium heat. Add ½ tsp. cumin seeds swirl the pan until the seeds start to sizzle and brown, 30 seconds to 1 minute. Remove from the heat.",
      "Drizzle the finished eggs with the butter mixture, season with salt and pepper, and garnish with parsley before serving."
    ],
    "image": "spiced-lentil-and-caramelized-onion-baked-eggs",
    "foodId": "87ab20c2ce634e459ff8e37255bdaade",
    "imageUrl": "https://res.cloudinary.com/dqmwlzgpe/image/upload/v1749474713/ingredify/spiced-lentil-and-caramelized-onion-baked-eggs.jpg"
  }
]
